{
    "HOME_PAGE": {
        "WELCOME": "Welcome",
        "DESCRIPTION": "Here you will find the information about me"
    },

    "HEADER":{
        "HOME": "Home",
        "ABOUT": "About me",
        "CONTACT": "Contact",
        "LANG": "Language",
        "PROJECTS": "Projects",
        "WORKS": "Works",

        "TITLE": "Portfolio",

        
        
        "ES": "ES",
        "CAT": "CAT",
        "EN": "EN"
    },
    "ABOUT-ME":{
        "TITLE": "About me",
        "FIRST_PARAGRAPH": "Hi, my name is <strong class='text-primary'>Denis Emanuel Lazarian</strong> and I'm a junior web developer aspiring full stack profile. I love learning new technologies and improving my skills. I'm currently learning <strong class='text-warning'>Angular</strong> and reinforcing my knowledge in <strong class='text-warning'>PHP</strong>, in addition to framework <strong class='text-warning'>Codeigniter 4</strong>.",

        "SECOND_PARAGRAPH":"I like to work as a team and, above all, learn from others. I consider myself to be a responsible, proactive person and eager to learn.",
        "THIRD_PARAGRAPH": "I've been working on personal projects to improve my skills and learn new technologies. I have also been doing dual training at EcityClic, where I have learned to work as a team and develop web applications in the language <strong class='text-warning'>JAVA</strong>. You can see some of my projects in the section of ",

        "LIVE": "<span class='fw-semibold text-primary me-3  '>Location:</span> Lleida, Catalonia (Spain). <br>",
        "DOWNLOAD_CV": "Download CV",
        "WORK": "<span class='fw-semibold text-primary me-3 mt-2'>Current Employment: </span> Studying the degree of Web Application Development (IES Caparrella). <br>",

        "LANGUAGES_LABEL": "Languages",

        "PROJECTS": "Projects",


        "SPANISH": "Spanish: High",
        "CATALAN": "Catalan: High",
        "ROMANIAN": "Romanian: Native",
        "ENGLISH": "English: Half-Low"
    },

    "CONTACT_TITLE": "Contact",

    "PROJECTS":{
        "TITLE": "Projects",
        "DESCRIPTION": "Here you will find some of my personal projects most prominent.",
    
        "PLACEHODEL_SEARCH": "Search by tags; PHP, JavaScript...",
    
        "DAWLY": {
            "TITLE": "Daw.ly",
            "DESCRIPTION": "It is a link manager system similar to the 'bitly' web platform, which allows you to shorten links and share them on social media. The system allows you to manage shortened links, in addition to being able to view visits to this link by selecting a range of days. For users with admin role, it also includes a user administration section, where you can view registered users, edit them, delete them and create new users."
        },
            
        "CI4-NEWS":{
            "TITLE": "CI4-News",
            "DESCRIPTION": "It is a simple news manager where news can be generated, edited, deleted and viewed. The system also has a user manager that includes role assignments, which are: Administrator, Editor and User. The system also has a user login and registration system, and some of its functions are restricted to unregistered users or users with specific roles."
        },
        
        "PROJECT-GAME":{
            "TITLE": "Ahorcado simple",
            "DESCRIPTION": "I'm from the simple hangman, with a dictionary of words in a text file, and their corresponding functionality to the right or wrong character depending on the randomly selected word. It doesn't have a time limit for failures, but it does have a time limit of 45 seconds. The game at the end of the game shows the time it took to finish it, and the word it took to guess."
        }
    },


    "WORKS":{
        "TRAGECTORY_TITLE": "Trajectoria",
        "TRAGECTORY_DESCRIPTION": "Here you find my work experience and my academic career.",
        "STATISTICS_TITLE": "My competencies",
        "STATISTICS_DESCRIPTION": "That's how I evaluate my capabilities in every area, language or programming tool.",
        
        "TIMELINE_ITEMS":{
            "ITEM_1": {
                "TITLE": "bachelor's degree",
                "DESCRIPTION": "I was a high school student in the Scientific-Technological modality, at the Institut la Mitjana in Pardinyes (Lleida-Catalonia, Spain)."
            },
            "ITEM_2": {
                "TITLE": "Format cycle upper grade (1st Course)",
                "DESCRIPTION": "I enrolled in this year and studied the first DAW (Web Application Development) course, where I started to introduce and understand the art of programming in general. In this year I started my route in programming, with JAVA as the first language."
            },
            "ITEM_3": {
                "TITLE": "Format cycle upper grade (2nd Course)",
                "DESCRIPTION": "I entered the most professional section of the web code in general this year. In this year, I started programming at frontend and backend level, developing myself, through practices and exercises, gaining experience with JavaScript and PHP languages, along with their frameworks, Angular and Codeigniter 4 respectively."
            },
            "ITEM_4": {
                "TITLE": "Internship at a company (Dual Mode)",
                "DESCRIPTION": "As well as being a student, I have also practiced dual-mode (over 1000 hours) in the company \"Ecityclic\" in Semic, where I have learned the ways of working in a company, and I have been able to put into practice my knowledge that I have been acquiring in the training cycle."
            }
        }
    }

}