{
    "HOME_PAGE": {
        "WELCOME": "Bienvenido/a",
        "DESCRIPTION": "Aqui econtrarás la información sobre mi"
    },

    "HEADER":{
        "HOME": "Inicio",
        "ABOUT": "Sobre mi",
        "CONTACT": "Contacto",
        "LANG": "Idioma",
        "PROJECTS": "Proyectos",
        "WORKS": "Trabajos",
        
        
        "ES": "ES",
        "CAT": "CAT",
        "EN": "EN",

        "TITLE": "Portafolio"
    },

    "ABOUT-ME":{
        "TITLE": "Sobre mi",
        "FIRST_PARAGRAPH": "Hola, mi nombre es <strong class='text-primary'>Denis Emanuel Lazarian</strong> y soy un desarrollador web junior aspirante a programador de perfil full stack. Me encanta aprender nuevas tecnologías y mejorar mis habilidades de programación. Actualmente, estoy aprendiendo <strong class='text-warning'>Angular</strong>  y reforzando mis conocimientos en <strong class='text-warning'>PHP</strong>, además del framework <strong class='text-warning'> Codeigniter 4</strong>.",
    
        "SECOND_PARAGRAPH":"Me gusta trabajar en equipo y sobre todo aprender de los demás. Me considero una persona responsable, proactiva y con muchas ganas de aprender.",
        "THIRD_PARAGRAPH": "He estado trabajando en proyectos personales para mejorar mis habilidades de programación y aprender nuevas tecnologías. Puedes ver algunos de mis proyectos en la sección de <a role='button' class='text-primary' id='pro-link-item' (click)='selectLink('projects')'>Proyectos</a>. También he estado realizando prácticas de formación DUAL en la empresa EcityClic, donde he aprendido a trabajar en equipo y a desarrollar aplicaciones web en lenguaje <strong class='text-warning'>JAVA</strong>.",

        "LIVE": "<span class='fw-semibold text-primary me-3  '>Ubicación:</span> Lleida, Cataluña (España). <br>",
        "DOWNLOAD_CV": "Descargar CV",
        "WORK": "<span class='fw-semibold text-primary me-3 mt-2'>Ocupación actual: </span> Estudiante de Desarrollo de Aplicaciones Web (IES Caparrella). <br>",

        "LANGUAGES_LABEL": "Idiomas",

        "SPANISH": "Español: Alto",
        "CATALAN": "Catalán: Alto",
        "ROMANIAN": "Rumano: Nativo",
        "ENGLISH": "Inglés: Medio-bajo"
    },

    "CONTACT_TITLE": "Contacto",

    "PROJECTS":{
        "TITLE": "Proyectos",
        "DESCRIPTION": "Aquí encontrarás algunos de mis proyectos personales más destacados.",
    
        "PLACEHODEL_SEARCH": "Búsqueda por etiquetas; PHP, JavaScript...",
        "DAWLY": {
            "TITLE": "Daw.ly",
            "DESCRIPTION": "Se trata de un sistema gestor de links similar a la plataforma web 'bitly', el cual permite acortar links y compartirlos en las redes sociales. El sistema permite gestionar los links acortados, además de poder ver las visitas a ese link seleccionando un rango de días. Para los usuarios con rol administrador, incluye también una sección de administración de usuarios, donde se puede ver los usuarios registrados, editarlos, eliminarlos y crear nuevos usuarios."
        },

        "CI4-NEWS":{
            "TITLE": "CI4-News",
            "DESCRIPTION": "Se trata de un gestor de noticias simple donde se pueden generar, editar, eliminar y visualizar noticias. El sistema también dispone de un gestor de usuarios en los cuales se incluye la asignación de roles, los cuales son: Administrador, Editor y Usuario. El sistema también dispone de un sistema de login y registro de usuarios, y algunas de sus funciones están restringidas para usuarios no registrados o usuarios con rol de específico."
        },

        "PROJECT-GAME":{
            "TITLE": "Ahorcado simple",
            "DESCRIPTION": "Juego del ahorcado simple, con un diccionario de palabras en un archivo de texto, i sus correspondientes funcionalidades a los aciertos o fallos de caracteres según la palabra seleccionada aleatoriamente. No dispone de limite de fallos, pero si de tiempo, el cual es de 45 segundos. El juego al finalizar la partida se muestra el tiempo que ha tardado en finalizarla, y la palabra que se tenia que adivinar."
        },
        
        "FLOURISH-AND-BLOTTS":{
            "TITLE": "Flourish and Blotts",
            "DESCRIPTION": "Se trata de un proyecto web que simula el servicio de una biblioteca de instituto, donde se pueden ver los libros disponibles, y también se puede realizar peticiones de prestamos y reservas de libros. También ofrece otros servicios i funciones para el rol de administradores responsables, los quales son los encargados de gestionar la biblioteca, donde realizan las funciones basicas como la de gestionar libros, assignar prestamos, establecer penalizaciones, entre otras funciones. Mas información en el repositorio del proyecto."
        }

    },

    "WORKS":{
        "TRAGECTORY_TITLE": "Trayectoria",
        "TRAGECTORY_DESCRIPTION": "Aquí encontraras mi experiencia laboral y mi recorrido académico.",
        "STATISTICS_TITLE": "Mis competencias",
        "STATISTICS_DESCRIPTION": "Así avalúo mis capacidades en cada área, lenguaje o herramienta de programación.",

        "TIMELINE_ITEMS":{
            "ITEM_1": {
                "TITLE": "Bachillerato",
                "DESCRIPTION": "Fui estudiante de bachillerato en la modalidad Científico-Tecnológico, en el Instituto la Mitjana en Pardiñas (Lleida-Cataluña, España)."
            },
            "ITEM_2": {
                "TITLE": "Ciclo formativo grado superior (1er Curso)",
                "DESCRIPTION": "En ese año me matriculé y estudié el primer curso de DAW (Desarrollo de Aplicaciones web), donde he empezado a introducir y entender el arte de la programación en general. En este año he empezado mi ruta en la programación, con el lenguaje JAVA como primer lenguaje."
            },
            "ITEM_3": {
                "TITLE": "Ciclo formativo grado superior (2nd Curso)",
                "DESCRIPTION": "En este año me he introducido en el apartado más profesional del código web en general. En este año he empezado a programar a nivel de frontend y backend, desarrollándome a mí mismo, mediante prácticas y ejercicios, obteniendo experiencia con los lenguajes JavaScript y PHP, junto con sus frameworks, Angular y Codeigniter 4 respectivamente."
            },
            "ITEM_4": {
                "TITLE": "Prácticas en empresa (modalidad DUAL)",
                "DESCRIPTION": "Al mismo tiempo que he estado estudiando, también he realizado las prácticas de empresa en modalidad DUAL (duración de 1000 horas) en la empresa \"Ecityclic\" de Semic, donde he aprendido las formas de trabajar en una empresa, y he podido poner en práctica mis conocimientos que he estado adquiriendo en el ciclo formativo."
            }
        }
    }

    





}

